#########################
#         角色          #
#########################
R = {
    "empty": 0,  # 无子
    "com": 1,  # AI
    "hum": 2  # 玩家
}

#########################
#        评分标准        #
#########################

S = {
    "ONE": 10,  # 活一
    "TWO": 100,  # 活二
    "THREE": 1000,  # 活三
    "FOUR": 100000,  # 活四
    "FIVE": 10000000,  # 连五

    # 当一侧被封死
    "BLOCKED_ONE": 1,  # 死一
    "BLOCKED_TWO": 10,  # 死二
    "BLOCKED_THREE": 100,  # 死三
    "BLOCKED_FOUR": 10000  # 死四
}

#########################
#          阈值         #
#########################
threshold = 1.15

#########################
#         配置项         #
#########################
C = {
    "searchDeep": 8,  # 搜索深度
    "countLimit": 20,  # gen 函数返回的节点数量上限
    "timeLimit": 100,  # 时间限制,秒
    "vcxDeep": 5,  # 算杀深度
    "random": False,  # 棋面评分一致时是否随机走一个
    "onlyThrees": True,  # 只考虑分数大于活三

    # 提升搜索速度
    "spreadLimit": 1,  # 单步延伸,长度限制
    "star": True,  # 是否开启 starspread
    "cache": True,
    "window": False,  # 是否启用期望窗口
}
